"""
Принципы Solid
1. Принцип единой ответственности требует, чтобы у класса была только одна ответсвенность,
одна функциональность за которую он ответсвенный (Single Responsibility  Principle)
2. Принцип открытости и закрытости что программные сущности должны быть открыты для расширения,
но закрыты для изменения
3. Принцип подстановки Барбары Лисков в ООП является специфичным определением подтипа
4. Принцип разделенности , программные сущности не должны зависить от методов которые они не используют
5. принцип инверсии зависимости

MVC Модель представление контроллер делим программу  на три компонента  модель хранятся данные,
общается с другими компонентами, user  смотрит на на view  который обновляется автоматически,
когда изменение произошли в модели  view обновляется автоматически
"""
#изучить черипай cherryPy

